Repository: Centaur/lua-nginx-module
Catalog: omegat/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Because when the content length exceeds [[HttpCoreModule#client_body_buffer_size|client_body_buffer_size]] but less than [[HttpCoreModule#client_max_body_size|client_max_body_size]], Nginx will buffer the data into a temporary file on the disk, which will lead to empty value in the [[HttpCoreModule#$request_body|$request_body]] variable.
zh_cn: 因为如果内容长度超过了[[HttpCoreModule#client_body_buffer_size|client_body_buffer_size]] 但小于 [[HttpCoreModule#client_max_body_size|client_max_body_size]], Nginx 将会把数据缓存到存盘上的临时文件中， [[HttpCoreModule#$request_body|$request_body]]变量中将是空值.

source: Before <code>ngx.thread.spawn</code> returns, the <code>func</code> will be called with those optional arguments until it returns, aborts with an error, or gets yielded due to I/O operations via the [[#Nginx API for Lua|Nginx API for Lua]] (like [[#tcpsock:receive|tcpsock:receive]]).
zh_cn: 在 <code>ngx.thread.spawn</code> 返回之前, <code>func</code> 将对那些可选的参数进行调用，直到此函数返回，或因出错而终止，或由于[[#Nginx API for Lua|Nginx API for Lua]] (例如[[#tcpsock:receivetcpsock:receive]])的I/O操作而挂起.

source: Before actually resolving the host name and connecting to the remote backend, this method will always look up the connection pool for matched idle connections created by previous calls of this method (or the [[#ngx.socket.connect|ngx.socket.connect]] function).
zh_cn: 在实际解析域名和连接到远程实体之前, 本方法总会查找连接池中之前用本方法(或[[#ngx.socket.connect|ngx.socket.connect]] 函数)创建的空闲连接.

source: Behind the scene, it is just a thin wrapper around the <code>ngx_crc32_long</code> function defined in the Nginx core.
zh_cn: 其内部实现其实是对Nginx核心<code>ngx_crc32_long</code>函数的小小封装。

source: Behind the scene, it is just a thin wrapper around the <code>ngx_crc32_short</code> function defined in the Nginx core.
zh_cn: 其内部实现其实是对Nginx核心<code>ngx_crc32_short</code>函数的小小封装。

source: Behind the scene, the "eof" flag is just the <code>last_buf</code> (for main requests) or <code>last_in_chain</code> (for subrequests) flag of the Nginx chain link buffers.
zh_cn: 在内部实现里， "eof" 标记其实是Nginx缓冲区链中的 <code>last_buf</code> (主请求) 或 <code>last_in_chain</code> (子请求) 标记

source: Behind the scene, this method makes use of the Nginx timers.
zh_cn: 其内部实现使用Nginx定时器.

source: Boolean argument values are also supported, for instance,
zh_cn: 支持布尔值作为参数，例如,

source: Both IP addresses and domain names can be specified as the <code>host</code> argument.
zh_cn: <code>host</code> 参数可以是IP地址或域名.

source: Build the source with this module:
zh_cn: 将本模块编译进Nginx:

source: But if you create subrequests to access other locations configured by Nginx upstream modules, then you should configure those upstream modules to ignore client connection abortions if they are not by default.
zh_cn: 但是如果你创建了子请求来访问由Nginx上游模块 配置的其它 location，你需要配置此上游模块忽略掉客户端发起的连接断开.

source: But note that, the [[#lua_shared_dict|lua_shared_dict]]'s shm storage will not be cleared through a config reload (via the <code>HUP</code> signal, for example).
zh_cn: 但请注意， [[#lua_shared_dict|lua_shared_dict]]的共享存储在重新加载配置文件（如通过<code>HUP</code>信号）时不会被清空。

source: But special care must be taken for injection attacks.
zh_cn: 但是要特别小心防止注入攻击。

source: But the subrequest API (like [[#ngx.location.capture|ngx.location.capture]]), the [[#ngx.req.start_time|ngx.req.*]] API, the downstream output API (like [[#ngx.say|ngx.say]], [[#ngx.print|ngx.print]], and [[#ngx.flush|ngx.flush]]) are explicitly disabled in this context.
zh_cn: 但是子请求API (如[[#ngx.location.capture|ngx.location.capture]]), [[#ngx.req.start_time|ngx.req.*]] API, 下游输出 API (如 [[#ngx.say|ngx.say]], [[#ngx.print|ngx.print]], 和[[#ngx.flush|ngx.flush]]) 在这个上下文中都是明确禁止使用的.

source: But this global variable will be cleared at the end of the request handler, and every subsequent request handler all has its own (clean) global environment.
zh_cn: 但是这个全局变量会在请求处理器结束时被清除，每个后续的请求处理器都有自己的（干净的）全局环境.

source: But when this size is greater than <code>8192</code>, then <code>8192</code> will be used instead.
zh_cn: 但如果这个值超过了 <code>8192</code>, 缓冲区大小为 <code>8192</code> .

source: By contrast, Nginx + php-fpm 5.2.8 + Unix Domain Socket yields 6k req/sec and [http://nodejs.org/ Node.js] v0.6.1 yields 10.2k req/sec for their Hello World equivalents.
zh_cn: 相比之下, Nginx + php-fpm 5.2.8 + Unix Domain Socket 的hello work结果为 6k req/sec ， [http://nodejs.org/ Node.js] v0.6.1 的hello world结果为 10.2k req/sec .

source: By default, a maximum of 100 request arguments are parsed (including those with the same name) and that additional URI arguments are silently discarded to guard against potential denial of service attacks.
zh_cn: 默认最多只解析100个请求参数 (包括名称一样的) ，多出来的请求参数将被简单丢弃，以防止DOS攻击.

source: By default, all the subrequests subsequently initiated by [[#ngx.location.capture|ngx.location.capture]] and [[#ngx.location.capture_multi|ngx.location.capture_multi]] will inherit the new header.
zh_cn: 所有用[[#ngx.location.capturengx.location.capture]] and [[#ngx.location.capture_multingx.location.capture_multi]]发起的子请求都默认继承新设置的头。

source: By default, only the first 1024 keys (if any) are returned.
zh_cn: 默认只返回前1024个值 (如果有的话.

source: By default, the corresponding Nginx handler (e.g., [[#rewrite_by_lua|rewrite_by_lua]] handler) will not terminate until # both the "entry thread" and all the user "light threads" terminates, # a "light thread" (either the "entry thread" or a user "light thread" aborts by calling [[#ngx.exit|ngx.exit]], [[#ngx.exec|ngx.exec]], [[#ngx.redirect|ngx.redirect]], or [[#ngx.req.set_uri|ngx.req.set_uri(uri, true)]], or # the "entry thread" terminates with a Lua error.
zh_cn: 默认情况下, 只有出现下列情况之一时相应的Nginx处理器 (例如, [[#rewrite_by_lua|rewrite_by_lua]] 处理器)才会终止 # "入口线程" 和所有用户 "轻量线程" 都结束了, # 某个 "轻量线程" (可能是"入口线程" 或某个用户 "轻量线程" 调用了 [[#ngx.exit|ngx.exit]], [[#ngx.exec|ngx.exec]], [[#ngx.redirect|ngx.redirect]], [[#ngx.req.set_uri|ngx.req.set_uri(uri, true)]]而终止 # "入口线程"由于Lua错误而终止.

source: By default, the request line and trailing <code>CR LF</code> terminator will also be included.
zh_cn: 默认情况下，包含请求行及结尾的 <code>CR LF</code>.

source: By default, this directive is turned off and the Lua code is postponed to run at the end of the <code>rewrite</code> phase.
zh_cn: 默认情况下，本命令处于关闭状态， Lua 代码在 <code>rewrite</code> 阶段的最后运行.

source: Calculates the CRC-32 (Cyclic Redundancy Code) digest for the <code>str</code> argument.
zh_cn: 计算<code>str</code>参数的 CRC-32 校验值.

source: Call [[#ngx.req.read_body|ngx.req.read_body]] to read the request body first or turn on the [[#lua_need_request_body|lua_need_request_body]] directive to avoid errors.
zh_cn: 为避免出错，先调用 [[#ngx.req.read_body|ngx.req.read_body]] 读取请求体或打开 [[#lua_need_request_body|lua_need_request_body]] 命令.

source: Calling the function with the <code>wait</code> argument set to <code>true</code> switches to synchronous mode.
zh_cn: 如果 <code>wait</code> 参数设为 <code>true</code> 则切换到同步模式.

source: Calling this method on an already connected socket object will cause the original connection to be closed first.
zh_cn: 对已经连接的socket对象调用此方法将导致之前的连接先被关闭.

source: Care should be taken in using this option as variable scope sharing can have unexpected side effects.
zh_cn: 要谨慎使用这个选项，因为变量域的共享可能会带来预料之外的副作用。

source: Changes made to these variables by such subrequests will not affect the parent request or any other subrequests sharing the parent request's variables.
zh_cn: 子请求对这些变量的修改不会影响到父请求和那些分享父请求变量的子请求。.

source: Check out [[#Nginx log level constants|Nginx log level constants]] for details.
zh_cn: 详情见 [[#Nginx log level constants|Nginx日志级别常量]].

source: Clear the current request's request header named <code>header_name</code>.
zh_cn: 清除当前请求中名为 <code>header_name</code> 的头.

source: Closes the current TCP or stream unix domain socket.
zh_cn: 关闭当前 TCP 或流 unix domain socket.

source: Closes the current UDP or datagram unix domain socket.
zh_cn: 关闭当前的UDP或数据报unix domain socket.

source: Completes the construction process of the new request body created by the [[#ngx.req.init_body|ngx.req.init_body]] and [[#ngx.req.append_body|ngx.req.append_body]] calls.
zh_cn: 完成由[[#ngx.req.init_bodyngx.req.init_body]] and [[#ngx.req.append_bodyngx.req.append_body]]实现的请求体创建过程。

source: Computes the [http://en.wikipedia.org/wiki/HMAC HMAC-SHA1] digest of the argument <code>str</code> and turns the result using the secret key <code><secret_key></code>.
zh_cn: 使用密钥<code><secret_key></code>计算<code>str</code>参数的 [http://en.wikipedia.org/wiki/HMAC HMAC-SHA1]文摘.

source: Connecting to a Unix Domain Socket file is also possible:
zh_cn: 也可以连接到Unix domain socket文件:

source: Consider the following example,
zh_cn: 考虑以下示例,

source: Consider the following example:
zh_cn: 考虑下面的例子:

source: Controls the <code>lowat</code> (low water) value for the cosocket send buffer.
zh_cn: 控制cosocket发送缓冲区的 <code>lowat</code> 值.

source: Controls the default timeout value used in TCP/unix-domain socket object's [[#tcpsock:send|send]] method and can be overridden by the [[#tcpsock:settimeout|settimeout]] method.
zh_cn: 本命令控制 TCP/unix-domain socket 对象[[#tcpsock:send|send]] 方法中使用的默认超时时间， 可以用 [[#tcpsock:settimeout|settimeout]] 方法进行修改.

source: Controls the maximum number of "running timers" allowed.
zh_cn: 控制“正在运行的定时器“数量的上限.

source: Controls the maximum number of pending timers allowed.
zh_cn: 控制未过期定时器数量的上限.

source: Controls whether or not to disable postponing [[#rewrite_by_lua|rewrite_by_lua]] and [[#rewrite_by_lua_file|rewrite_by_lua_file]] directives to run at the end of the <code>rewrite</code> request-processing phase.
zh_cn: 控制是否禁止延后 [[#rewrite_by_lua|rewrite_by_lua]] 和[[#rewrite_by_lua_file|rewrite_by_lua_file]] 命令，使其在 <code>rewrite</code> 请求处理阶段的最后运行.

source: Controls whether to transform underscores (<code>_</code>) in the response header names specified in the [[#ngx.header.HEADER|ngx.header.HEADER]] API to hypens (<code>-</code>).
zh_cn: 控制是否将 [[#ngx.header.HEADER|ngx.header.HEADER]] API中指定的响应头名称里的下划线 (<code>_</code>) 转换成减号 (<code>-</code>).

source: Creates a new blank request body for the current request and inializes the buffer for later request body data writing via the [[#ngx.req.append_body|ngx.req.append_body]] and [[#ngx.req.finish_body|ngx.req.finish_body]] APIs.
zh_cn: 为当前请求创建一个新的空请求体，初始化其缓冲区供后续的 [[#ngx.req.append_body|ngx.req.append_body]] 和 [[#ngx.req.finish_body|ngx.req.finish_body]] 写入.

source: Creates a user Lua coroutines with a Lua function, and returns a coroutine object.
zh_cn: 用Lua函数创建一个用户Lua coroutine，返回coroutine对象.

source: Creates an Nginx timer with a user callback function as well as optional user arguments.
zh_cn: 使用用户回调函数及可选参数创建Nginx定时器.

source: Creates and returns a TCP or stream-oriented unix domain socket object (also known as one type of the "cosocket" objects).
zh_cn: 创建并返回一个TCP或流unix domain socket对象 (也是 "cosocket" 的一种).

source: Creates and returns a UDP or datagram-oriented unix domain socket object (also known as one type of the "cosocket" objects).
zh_cn: 创建并返回一个UDP或基于数据报的 unix domain socket 对象(也是 "cosocket" 的一种).

source: Curly braces can also be used to disambiguate variable names from the background string literals:
zh_cn: 可以用大括号来消除变量名与后台字符量的歧义:

source: Current possible values are 1.0, 1.1, and 0.9.
zh_cn: 目前可能的值有 1.0, 1.1, 和 0.9.

source: Currently only numerical [[#HTTP method constants|method constants]] are supported, like <code>ngx.HTTP_POST</code> and <code>ngx.HTTP_GET</code>.
zh_cn: 当前仅支持数字 [[#HTTP method constants|方法常量]], 如<code>ngx.HTTP_POST</code> 和 <code>ngx.HTTP_GET</code>.

source: D enable duplicate named pattern support.
zh_cn: D 打开重复具名模板支持.

source: Declares a shared memory zone, <code><name></code>, to serve as storage for the shm based Lua dictionary <code>ngx.shared.<name></code>.
zh_cn: 声明一个共享内存区， <code><name></code>, 作为基于共享内存的 Lua 字典 <code>ngx.shared.<name></code>的存储区.

source: Decodes a URI encoded query-string into a Lua table.
zh_cn: 将 URI编码的 query-string 解析为Lua table.

source: Decodes the <code>str</code> argument as a base64 digest to the raw form.
zh_cn: 对<code>str</code> 进行base64解码.

source: Default to 30 connections for every pool.
zh_cn: 默认每个连接池最多30个连接。

source: Default to <code>false</code>.
zh_cn: 默认为<code>false</code>.

source: Defaults to <code>0</code>.
zh_cn: 默认值是 <code>0</code>.

source: Delegating all network and disk I/O operations to Nginx's subrequests (via the [[#ngx.location.capture|ngx.location.capture]] method and similar) is strongly recommended for maximum performance.
zh_cn: 为获得最好的性能，强烈推荐将网络和磁盘I/O委托给 Nginx's 子请求 (通过 [[#ngx.location.capture|ngx.location.capture]] 或类似的方法)。

source: Determines whether to force the request body data to be read before running rewrite/access/access_by_lua* or not.
zh_cn: 决定在运行 rewrite/access/access_by_lua* 之前是否强制读取请求体数据.

source: Disabling the Lua code cache is strongly discouraged for production use and should only be used during development as it has a significant negative impact on overall performance.
zh_cn: 禁止代码缓存在生产环境中是非常不推荐的，对整体的性能有很大的负面影响，只应用于开发阶段。

source: Disk operations with relatively small amount of data can be done using the standard Lua <code>io</code> library but huge file reading and writing should be avoided wherever possible as they may block the Nginx process significantly.
zh_cn: 对少量数据的磁盘操作可以用标准Lua <code>io</code> 库来完成，但是应尽可能避免对大文件的读取和写入，因为这会严重阻塞Nginx进程。

source: Do not activate the <code>o</code> option for regular expressions (and/or <code>replace</code> string arguments for [[#ngx.re.sub|ngx.re.sub]] and [[#ngx.re.gsub|ngx.re.gsub]]) that are generated ''on the fly'' and give rise to infinite variations to avoid hitting the specified limit.
zh_cn: 不要为运行时动态生成的正则表达式设置<code>o</code>模式，（或是为 [[#ngx.re.sub|ngx.re.sub]] 和 [[#ngx.re.gsub|ngx.re.gsub]] 提供<code>replace</code> 字符串参数) 以避免超限。

source: Do not turn on the [[#lua_need_request_body|lua_need_request_body]] directive, and do not mix this call with [[#ngx.req.read_body|ngx.req.read_body]] and [[#ngx.req.discard_body|ngx.req.discard_body]].
zh_cn: 不要打开 [[#lua_need_request_body|lua_need_request_body]] 命令, 而且不要将本函数与 [[#ngx.req.read_body|ngx.req.read_body]] 和 [[#ngx.req.discard_body|ngx.req.discard_body]] 混用.

source: Do not use backlashes to escape dollar signs; it will not work as expected.
zh_cn: 还要用反斜杠对美元符进行转义.

source: Do not use this directive and other content handler directives in the same location.
zh_cn: 在同一个location中不要同时使用本命令和其它content handler命令。

source: Does an internal redirect to <code>uri</code> with <code>args</code>.
zh_cn: 使用<code>args</code>作为参数发起到 <code>uri</code> 的内部重定向 .

source: Due to the limitation in the Nginx subrequest model, it is not allowed to abort a running Nginx subrequest in general.
zh_cn: 由于Nginx子请求模型的限制，通常不允许中断一个正在运行的Nginx子请求.

source: Each request handler has its own set of Lua global variables and that is the idea of request isolation.
zh_cn: 每个请求处理器都有它自己的Lua全局变量集，这就是请求隔离的概念.

source: Emits arguments concatenated to the HTTP client (as response body).
zh_cn: 将参数（作为响应体）发送给客户端.

source: Empty key arguments are discarded.
zh_cn: 空的key参数将被丢弃.

source: Enables or disables automatic response buffering for HTTP 1.0 (or older) requests.
zh_cn: 打开/关闭 HTTP 1.0(或更低版本)的请求的自动响应缓冲。

source: Enables or disables the Lua code cache for [[#set_by_lua_file|set_by_lua_file]], [[#content_by_lua_file|content_by_lua_file]], [[#rewrite_by_lua_file|rewrite_by_lua_file]], and [[#access_by_lua_file|access_by_lua_file]], and also force Lua module reloading on a per-request basis.
zh_cn: 为 [[#set_by_lua_file|set_by_lua_file]], [[#content_by_lua_file|content_by_lua_file]], [[#rewrite_by_lua_file|rewrite_by_lua_file]], and [[#access_by_lua_file|access_by_lua_file]] 打开或关闭Lua代码缓存, 同时强制为每个请求重新加载Lua模块。

source: Encode <code>str</code> to a base64 digest.
zh_cn: 将<code>str</code> 进行 base64 编码.

source: Encode the Lua table to a query args string according to the URI encoded rules.
zh_cn: 根据URI编码规则将Lua table编码成一个query string.

source: Equivalent to [[#access_by_lua|access_by_lua]], except that the file specified by <code><path-to-lua-script-file></code> contains the Lua code, or, as from the <code>v0.5.0rc32</code> release, the [[#Lua/LuaJIT bytecode support|Lua/LuaJIT bytecode]] to be executed.
zh_cn: 同 [[#access_by_lua|access_by_lua]], 区别在于 <code><path-to-lua-script-file></code> 可以包含 Lua 代码, 或者, 从 <code>v0.5.0rc32</code> 版本开始, 可以包含 [[#Lua/LuaJIT bytecode support|Lua/LuaJIT 字节码]]。

source: Equivalent to [[#body_filter_by_lua|body_filter_by_lua]], except that the file specified by <code><path-to-lua-script-file></code> contains the Lua code, or, as from the <code>v0.5.0rc32</code> release, the [[#Lua/LuaJIT bytecode support|Lua/LuaJIT bytecode]] to be executed.
zh_cn: 同 [[#body_filter_by_lua|body_filter_by_lua]], 区别在于 <code><path-to-lua-script-file></code> 可以包含 Lua 代码, 或者, 从 <code>v0.5.0rc32</code> 版本开始, 可以包含 [[#Lua/LuaJIT bytecode support|Lua/LuaJIT 字节码]]。

source: Equivalent to [[#content_by_lua|content_by_lua]], except that the file specified by <code><path-to-lua-script-file></code> contains the Lua code, or, as from the <code>v0.5.0rc32</code> release, the [[#Lua/LuaJIT bytecode support|Lua/LuaJIT bytecode]] to be executed.
zh_cn: 同 [[#content_by_lua|content_by_lua]], 区别在于 <code><path-to-lua-script-file></code> 可以包含或, 从<code>v0.5.0rc32</code> 版本开始, 可以包含 [[#Lua/LuaJIT bytecode support|Lua/LuaJIT 字节码]].

source: Equivalent to [[#header_filter_by_lua|header_filter_by_lua]], except that the file specified by <code><path-to-lua-script-file></code> contains the Lua code, or as from the <code>v0.5.0rc32</code> release, the [[#Lua/LuaJIT bytecode support|Lua/LuaJIT bytecode]] to be executed.
zh_cn: 同 [[#header_filter_by_luaheader_filter_by_lua]], 区别在于 <code><path-to-lua-script-file></code> 可以包含 Lua 代码, 或者, 从 <code>v0.5.0rc32</code> 版本开始, 可以包含 [[#Lua/LuaJIT bytecode support|Lua/LuaJIT 字节码]]。

source: Equivalent to [[#init_by_lua|init_by_lua]], except that the file specified by <code><path-to-lua-script-file></code> contains the Lua code or [[#Lua/LuaJIT bytecode support|Lua/LuaJIT bytecode]] to be executed.
zh_cn: 类似 [[#init_by_lua|init_by_lua]], 区别在于 <code><path-to-lua-script-file></code> 可以包含 Lua 代码或是 [[#Lua/LuaJIT bytecode support|Lua/LuaJIT 字节码]]。

source: Equivalent to [[#log_by_lua|log_by_lua]], except that the file specified by <code><path-to-lua-script-file></code> contains the Lua code, or, as from the <code>v0.5.0rc32</code> release, the [[#Lua/LuaJIT bytecode support|Lua/LuaJIT bytecode]] to be executed.
zh_cn: 同[[#log_by_lua|log_by_lua]], 区别在于 <code><path-to-lua-script-file></code> 可以包含或, 从 <code>v0.5.0rc32</code> 版本开始, 可以包含[[#Lua/LuaJIT bytecode support|Lua/LuaJIT 字节码]].

source: Equivalent to [[#rewrite_by_lua|rewrite_by_lua]], except that the file specified by <code><path-to-lua-script-file></code> contains the Lua code, or, as from the <code>v0.5.0rc32</code> release, the [[#Lua/LuaJIT bytecode support|Lua/LuaJIT bytecode]] to be executed.
zh_cn: 同[[#rewrite_by_lua|rewrite_by_lua]], 区别在于 <code><path-to-lua-script-file></code> 可以包含或, 从 <code>v0.5.0rc32</code> 版本开始, 可以包含[[#Lua/LuaJIT bytecode support|Lua/LuaJIT 字节码]].

source: Equivalent to [[#set_by_lua|set_by_lua]], except that the file specified by <code><path-to-lua-script-file></code> contains the Lua code, or, as from the <code>v0.5.0rc32</code> release, the [[#Lua/LuaJIT bytecode support|Lua/LuaJIT bytecode]] to be executed.
zh_cn: 同 [[#set_by_lua|set_by_lua]], 区别在于 <code><path-to-lua-script-file></code> 可以包含 Lua 代码, 或者, 从 <code>v0.5.0rc32</code> 版本开始, 可以包含 [[#Lua/LuaJIT bytecode support|Lua/LuaJIT 字节码]]。

source: Escape <code>str</code> as a URI component.
zh_cn: 将 <code>str</code> 转义成 URI 片段.

source: Even the Nginx core does blocking I/O (at least on resolving upstream's host names) at the configure-loading phase.
zh_cn: Nginx 内核自己在加载配置的阶段也用阻塞 I/O (至少在解析 upstream 主机名时) .

source: Every request, including subrequests, has its own copy of the table.
zh_cn: 每个请求, 包括子请求, 都有对这个table的独立拷贝。

source: Everything should be installed correctly, except for one small tweak.
zh_cn: 一切都应该顺利安装，只有一个小问题.

source: Everything works internally, efficiently, on the C level.
zh_cn: 一切都在内部C这一层高效运行。

source: Executes code specified in <code><lua-script-str></code> with optional input arguments <code>$arg1 $arg2 ...</code>, and returns string output to <code>$res</code>.
zh_cn: 执行 <code><lua-script-str></code> 中的代码，可选参数 <code>$arg1 $arg2 ...</code>, 返回字符串输出到 <code>$res</code>中.

source: Explicitly discard the request body, i.e., read the data on the connection and throw it away immediately.
zh_cn: 显式地丢弃请求体，即, 从连接中读取数据但是马上丢掉它.

source: Explicitly send out the response headers.
zh_cn: 显式地发送响应头.

source: Explicitly specify the end of the response output stream.
zh_cn: 显式地标出响应输出流的结尾.

source: Fetch a list of the keys from the dictionary, up to <code><max_count></code>.
zh_cn: 从字典中返回键的列表, 数量最大为 <code><max_count></code>.

source: Fetching the shm-based Lua dictionary object for the shared memory zone named <code>DICT</code> defined by the [[#lua_shared_dict|lua_shared_dict]] directive.
zh_cn: 获取由 [[#lua_shared_dictlua_shared_dict]]命令定义的基于共享内存的Lua字典对象 <code>DICT</code> .

source: Flushes out all the items in the dictionary.
zh_cn: 清除字典中所有项目.

source: Flushes out the expired items in the dictionary, up to the maximal number specified by the optional <code>max_count</code> argument.
zh_cn: 消除字典中过期的项, 最多清除 <code>max_count</code> 项.

source: Flushes response output to the client.
zh_cn: 将响应数据输出至客户端.

source: For (soft) real-time web applications, it is highly recommended to configure the [http://tldp.org/HOWTO/TCP-Keepalive-HOWTO/overview.html TCP keepalive] support in your system's TCP stack implementation in order to detect "half-open" TCP connections in time.
zh_cn: 对于 (软) 实时web应用, 强烈推荐为系统的TCP栈实现配置 [http://tldp.org/HOWTO/TCP-Keepalive-HOWTO/overview.html TCP keepalive] 支持以便随时检测 "半开"TCP连接。

source: For example,
zh_cn: 例如,

source: For example, by default the standard [[HttpProxyModule]] will terminate both the subrequest and the main request as soon as the client closes the connection, so it is important to turn on the [[HttpProxyModule#proxy_ignore_client_abort|proxy_ignore_client_abort]] directive in your location block configured by [[HttpProxyModule]]:
zh_cn: 例如，For example, by default the standard [[HttpProxyModule]]默认会在客户端关闭连接时同时终止子请求和父请求，所以需要在[[HttpProxyModule]]配置的location中打开 [[HttpProxyModule#proxy_ignore_client_abort|proxy_ignore_client_abort]] 命令:

source: For example, if a request header <code>My-Foo-Header</code> is present, then the following invocations will all pick up the value of this header correctly:
zh_cn: 例如，如果有一个请求头 <code>My-Foo-Header</code> , 以下各种写法都能正确获得这个头的值:

source: For example, it can simply ignore the event by doing nothing and the current Lua request handler will continue executing without interruptions.
zh_cn: 例如，它可以简单地忽略掉些事情，不做任何事情，当前的Lua请求处理器将继续执行，不受影响.

source: For example, on Linux, you can configure the standard [[HttpCoreModule#listen|listen]] directive in your <code>nginx.conf</code> file like this:
zh_cn: 例如，在Linux上，你可以在<code>nginx.conf</code>文件中这样配置标准的 [[HttpCoreModule#listen|listen]] 命令:

source: For example, response headers
zh_cn: 例如，响应头

source: For example, the following nginx config snippet
zh_cn: 例如，下面的nginx配置代码

source: For example, this directive and the [[HttpProxyModule#proxy_pass|proxy_pass]] directive should not be used in the same location.
zh_cn: 例如， 这条命令和 [[HttpProxyModule#proxy_pass|proxy_pass]] 命令不允许在同一个location中使用。

source: For example, to transform all the lowercase letters in the response body, we can just write:
zh_cn: 例如，要将转换响应体中的所有小写字母，可以写:

source: For example, when using the standard <code>ngx_proxy</code> module to serve subrequests, an "Accept-Encoding: gzip" header in the main request may result in gzipped responses that cannot be handled properly in Lua code.
zh_cn: 例如，如果用标准的 <code>ngx_proxy</code> 模块来为子请求服务, 主请求中的 "Accept-Encoding: gzip" 头可能会导致无法被Lua代码正常处理的被压缩的响应。

source: For example:
zh_cn: 例如:

source: For instance,
zh_cn: 例如,

source: For instance, Nginx config
zh_cn: 例如，Nginx配置
